In [1]:
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [2]:
# File to Load (Remember to change these)
data_csv = "../who_suicide_statistics.csv"

# Read the City and Ride Data
data = pd.read_csv(data_csv)

In [3]:
# Clean data
data.dropna(how='any', inplace=True)

data = data[data.suicides_no != 0]
data.reset_index(inplace=True)
data.drop(columns={'index'}, inplace=True)
data.head(20)

    country  year     sex          age  suicides_no  population
0   Albania  1987  female  15-24 years         14.0    289700.0
1   Albania  1987  female  25-34 years          4.0    257200.0
2   Albania  1987  female  35-54 years          6.0    278800.0
3   Albania  1987  female    75+ years          1.0     35600.0
4   Albania  1987    male  15-24 years         21.0    312900.0
5   Albania  1987    male  25-34 years          9.0    274300.0
6   Albania  1987    male  35-54 years         16.0    308000.0
7   Albania  1987    male  55-74 years          1.0    137500.0
8   Albania  1987    male    75+ years          1.0     21800.0
9   Albania  1988  female  15-24 years          8.0    295600.0
10  Albania  1988  female  25-34 years          5.0    262400.0
11  Albania  1988  female  35-54 years          4.0    284500.0
12  Albania  1988  female  55-74 years          3.0    147500.0
13  Albania  1988  female    75+ years          2.0     36400.0
14  Albania  1988    male  15-24 years         17.0    319200.0
15  Albania  1988    male  25-34 years          5.0    279900.0
16  Albania  1988    male  35-54 years         14.0    314100.0
17  Albania  1988    male  55-74 years          4.0    140200.0
18  Albania  1988    male    75+ years          1.0     22300.0
19  Albania  1989  female  15-24 years          5.0    299900.0

In [4]:
data['suicides_no']=data['suicides_no'].astype('int')
data['population']=data['population'].astype('int')

data.head()

   country  year     sex          age  suicides_no  population
0  Albania  1987  female  15-24 years           14      289700
1  Albania  1987  female  25-34 years            4      257200
2  Albania  1987  female  35-54 years            6      278800
3  Albania  1987  female    75+ years            1       35600
4  Albania  1987    male  15-24 years           21      312900

In [5]:
# groupby total per gender
sex_group = data.groupby('sex')

sex_gp_df = pd.DataFrame(sex_group.sum())
sex_gp_df.drop(columns={'year','population'}, inplace=True)
sex_gp_df['suicides_no'] = sex_gp_df['suicides_no'].astype('int')
sex_gp_df

        suicides_no
sex
female      1894294
male        6104173

In [6]:
#gropby total per age group
#usable for bar chart
age_group = data.groupby('age')

age_gp_df = pd.DataFrame(age_group.sum())
age_gp_df.drop(columns={'year','population'}, inplace=True)
age_gp_df['suicides_no'] = age_gp_df['suicides_no'].astype('int')
age_gp_df

             suicides_no
age
15-24 years       975700
25-34 years      1360780
35-54 years      2887740
5-14 years         62320
55-74 years      1955150
75+ years         756777

In [7]:
#group by countries
cn_group = data.groupby('country')

cn_sum=cn_group.sum()

cn_sum.sort_values(by='suicides_no',ascending=False, inplace=True)
cn_sum.drop(columns={'population','year'}, inplace=True)
cn_sum.head(10)

                          suicides_no
country
Russian Federation          1500992.0
United States of America    1201401.0
Japan                        937614.0
France                       395500.0
Ukraine                      365170.0
Germany                      291262.0
Republic of Korea            261730.0
Brazil                       250824.0
Poland                       172562.0
United Kingdom               166314.0

In [33]:
#groups by year
year_group = data.groupby(['year','sex'])

yeardf=year_group.sum()
yeardf.drop(columns={'population'},inplace=True)

yeardf

             suicides_no
year sex
1979 female        29418
     male          63372
1980 female        42629
     male         110771
1981 female        47448
     male         130257
1982 female        47564
     male         134871
1983 female        34759
     male          87407
1984 female        34765
     male          89499
1985 female        50285
     male         146830
1986 female        51332
     male         137352
1987 female        50062
     male         135695
1988 female        48298
     male         132428
1989 female        47582
     male         137774
1990 female        52914
     male         151129
1991 female        51209
     male         153027
1992 female        53273
     male         165173
1993 female        53015
     male         175936
...                  ...
2002 female        56327
     male         203049
2003 female        56397
     male         202939
2004 female        54078
     male         190118
2005 female        52867
     male         184689
2006 female        52810
     male         183590
2007 female        54012
     male         182167
2008 female        54679
     male         183560
2009 female        55652
     male         190671
2010 female        54947
     male         186576
2011 female        55211
     male         183837
2012 female        53680
     male         179154
2013 female        52965
     male         175375
2014 female        52851
     male         174384
2015 female        48427
     male         159200
2016 female         3623
     male          12615

[76 rows x 1 columns]